08-rails/moma/app/controllers/works_controller.rb

  def index
    @works = Work.all
---
SELECT "works".* FROM "works"

  def create
    work = Work.create work_params
---
INSERT INTO "works" ("title", "year", "medium", "style", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
    @work = Work.find params[:id]
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    work = Work.find params[:id]
    work.update work_params
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
UPDATE "works" SET "artist_id" = ?, "updated_at" = ? WHERE "works"."id" = ?  [["artist_id", nil], ["updated_at", "2022-07-20 06:04:13.040773"], ["id", 16]]

  def show
    @work = Work.find params[:id]
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def destroy
    work = Work.find params[:id]
    work.destroy
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "works" WHERE "works"."id" = ?  [["id", 8]]