08-rails/solar-system/app/controllers/planets_controller.rb

    def index
        @planets = Planet.all
---
SELECT "planets".* FROM "planets"

    def show
        @planet = Planet.find params[:id]
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

    def create
        # make a new planet
        # fill in the form data from params
        # save the planet
        planet = Planet.create :name => params[:name], :image => params[:image], :orbit => params[:orbit], :diameter => params[:diameter], :mass => params[:mass], :moons => params[:moons]
---
INSERT INTO "planets" ("name", "image", "orbit", "diameter", "mass", "moons") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Saturn"], ["image", "https://www.nasa.gov/sites/default/files/thumbnails/image/edu_ring_a-round_the_saturn.jpg"], ["orbit", 123.0], ["diameter", 456.0], ["mass", 789.0], ["moons", 4]]

    def edit
        @planet = Planet.find params[:id]
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

    def update
        planet = Planet.find params[:id]
        planet.name = params[:name]
        planet.image = params[:image]
        planet.orbit = params[:orbit]
        planet.diameter = params[:diameter]
        planet.mass = params[:mass]
        planet.moons = params[:moons]
        planet.save
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "planets" SET "moons" = ? WHERE "planets"."id" = ?  [["moons", nil], ["id", 10]]

    def destroy
        planet = Planet.find params[:id]
        planet.destroy
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "planets" WHERE "planets"."id" = ?  [["id", 11]]