08-rails/tunr/app/controllers/mixtapes_controller.rb

  def create
    mixtape = Mixtape.create mixtape_params
---
INSERT INTO "mixtapes" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "poop"], ["created_at", "2022-07-22 00:21:49.364759"], ["updated_at", "2022-07-22 00:21:49.364759"]]