08-rails/tunr/app/controllers/session_controller.rb

  def create
    # find the user by email
    user = User.find_by :email => params[:email]
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jonesy@ga.co"], ["LIMIT", 1]]